wsit/benchmark/2/response.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" S:mustUnderstand="1">
<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="3">
<wsu:Created>2006-06-29T06:20:13Z</wsu:Created>
<wsu:Expires>2006-06-29T06:25:13Z</wsu:Expires>
</wsu:Timestamp>
<xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:DataReference URI="#XWSSGID-11515620137501599888377"/>
</xenc:ReferenceList>
<wsse11:SignatureConfirmation xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" Value="U7mJ3hV7db/jK+WKlVr8HLohz908omAoHUoZ2oClLIq2TjJCHwmJkYF04MNoXNZ16alkhTgE+pxX4XOhXZJBRCLcGUpQKLyfUUl1DhoDLrWqqaD+KkX5Ti31/0pqtkVFWcxC0B3D8YP5+/mHFVpLppoMIY2bv7veVwBJSHkvEMs=" wsu:Id="XWSSGID-1151562013671964104550"/>
<wsse11:SignatureConfirmation xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" Value="I9hb79QkKe+YbYFL2lg/2AsU+Xg=" wsu:Id="XWSSGID-1151562013671-1105927648"/>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="1">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse S"/>
</ds:CanonicalizationMethod>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
<ds:Reference URI="#XWSSGID-1151562013671-1105927648">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse11 wsu wsse S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>tdwpQBB1+6W4ZWZtlfg7k/i7AGo=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#XWSSGID-1151562013671964104550">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse11 wsu wsse S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>DUVlKKtl+gtivU9A4HRh0p2JzGw=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#XWSSGID-1151562013671-1372713173">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>moJNoyVrFmDCOez3ugKyIuv1BGk=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#XWSSGID-115156201367191289678">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>KMEwRp1xYTjcDOPKeYCINHxKY4Y=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#XWSSGID-1151562013687-1968478546">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>twYmlxkUQ34CgteHE8+0932XUwY=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#XWSSGID-1151562013687855670302">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>yzt4Rgoc8ePKo7v+qySoavumnBY=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#3">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<InclusiveNamespaces xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsu wsse S"/>
</ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>ZbWo2xPi8FwKdCX7XzqjsZ4Its8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>VSxe52Gn08OxRUjFV0+f9fdyaiM=</ds:SignatureValue>
<ds:KeyInfo>
<wsse:SecurityTokenReference>
<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1">O85UAK5/ZgrIY0e0ZuiDaWVEuyo=</wsse:KeyIdentifier>
</wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature>
</wsse:Security>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="XWSSGID-1151562013671-1372713173">http://www.w3.org/2005/08/addressing/anonymous</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="XWSSGID-115156201367191289678">http://xmlsoap.org/Ping/IPingService/PingResponse</Action>
<RelatesTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="XWSSGID-1151562013687-1968478546">uuid:b633c6df-7ce5-4007-b292-6537e06d7d53</RelatesTo>
</S:Header>
<S:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="XWSSGID-1151562013687855670302">
<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="XWSSGID-11515620137501599888377" Type="http://www.w3.org/2001/04/xmlenc#Content">
    <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/>
    <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1">O85UAK5/ZgrIY0e0ZuiDaWVEuyo=</wsse:KeyIdentifier>
</wsse:SecurityTokenReference>
</ds:KeyInfo>
    <xenc:CipherData>
<xenc:CipherValue>QGIaIOkhH7B2XJfAF1USjOrg6iGoLe/8bOlwwFNz4qhjuTM5DYwxLcrIT1DdVhiTB7bo24JWDbWP
XbjgNK/0a5OWtWySAZQ87EkRLHfHdlsEW6U7yGyHtgCr/lnLUWy7nhxi07oiEgVHpn1vQJxf9gzT
cd1CvYALuKXgmkSgCQSe5+RRzRopOOENjxGf4ggH72l+1JURGPXj0xuVf34MCtI9oN9ues3r0SjB
CI99czo7KYJ3mrhUxbEdhcEgJIDtQCQzCcHZOOOy7YUzAq7iHm6fd0XVeJeL/tHj6OkGriVlRwyK
2fCs0wEIDr8qy8Np</xenc:CipherValue>
</xenc:CipherData>
    </xenc:EncryptedData>
</S:Body>
</S:Envelope>